<a href="https://colab.research.google.com/github/KERAMA-sys/classwork/blob/master/SQL_DS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [50]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [51]:
%sql sqlite://

'Connected: @None'

In [4]:
%%sql
CREATE TABLE IF NOT EXISTS Citizens(
  NationalID int,
  FirstName varchar(20),
  LastName varchar(20),
  Address varchar(20)

);
SELECT * from Citizens;

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS books(
  ReleaseDate date,
  Author Text,
  Book_title varchar(50),
  catergory varchar(20),
  Rating varchar(100)
);
SELECT * from books

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql 
CREATE TABLE IF NOT EXISTS Customer(
  Cust_ID int,
  lastName varchar(25),
  firstname varchar(20),
  Pay float
);
SELECT * from Customer

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Employees(
  Employee_num int,
  Employee_Name varchar(50),
  Department varchar(20),
  Salary float
);
SELECT * from Employees

 * sqlite://
Done.
Done.

[]

In [ ]:
#DEFAULT TYPES

In [7]:
%%sql
CREATE TABLE IF NOT EXISTS students(
  id varchar(20),
  StudentName varchar(20),
  Age int DEFAULT 'Unknown'
);
SELECT * from students

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS ALCOHOL(
  ID int,
  ParticipantName text,
  Age int DEFAULT 18,
  Opinion text
);
SELECT * from ALCOHOL

 * sqlite://
Done.
Done.

[]

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS Restaurants(
  name text,
  Description text,
  Address str DEFAULT 'Unknown',
  User_id int,
  Last_orders_at date

);
SELECT * from Restaurants

 * sqlite://
Done.
Done.

[]

In [9]:
#altering SQL table
%%sql
ALTER TABLE students ADD Gender;
SELECT * from students;

 * sqlite://
Done.
Done.

[]

In [18]:
%%sql
ALTER TABLE students DROP COLUMN Gender;
SELECT *from students;

 * sqlite://
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE students DROP COLUMN Gender;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [14]:
%%sql
ALTER TABLE students RENAME TO School;
SELECT * from School;

 * sqlite://
Done.
Done.

[]

In [19]:
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers(
  ID int,
  name text,
  Age int DEFAULT 21,
  Gender varchar(20)
);

select * from TeamMembers;

 * sqlite://
Done.
Done.

[]

In [23]:
%%sql
ALTER TABLE TeamMembers ADD D_O_B;

select * from TeamMembers;

 * sqlite://
Done.
Done.

[]

In [25]:
%%sql
ALTER TABLE TeamMembers DROP COLUMN D_O_B;

select * from TeamMembers;

 * sqlite://
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE TeamMembers DROP COLUMN D_O_B;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [26]:
#selecting and Retrieving Data with Sql

In [27]:
import csv 
import pandas as pd

In [32]:
with open('/Countries.csv','r') as Countries:
  Interpol = pd.read_csv(Countries,encoding='utf-8')

  %sql DROP TABLE IF EXISTS Interpol;
  %sql PERSIST Interpol;

 * sqlite://
Done.
 * sqlite://

In [35]:
with open('/WorldCup.csv','r') as WC:
  WorldCup = pd.read_csv(WC,encoding='utf-8')

  %sql DROP TABLE IF EXISTS WorldCup;
  %sql PERSIST WorldCup;

 * sqlite://
Done.
 * sqlite://

In [36]:
%sql select * from Interpol limit 5

 * sqlite://
Done.

[(0, 'Albania', 3, 3, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/al.gif'),
 (1, 'Angola', 0, 0, 1, 'Northern Africa', 'http://www.crwflags.com/fotw/images/a/ao.gif'),
 (2, 'Argentina', 2, 2, 1, 'South America', 'http://www.crwflags.com/fotw/images/a/ar.gif'),
 (3, 'Australia', 1, 1, 2, 'Oceania', 'http://www.crwflags.com/fotw/images/a/au.gif'),
 (4, 'Austria', 1, 1, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/at.gif')]

In [37]:
%sql select * from WorldCup limit 5

 * sqlite://
Done.

[(0, 1930, '13 Jul 1930 - 15:00 ', 'Group 1', 'Pocitos', 'Montevideo ', 'France', 4, 1, 'Mexico', ' ', 4444.0, 3, 0, 'LOMBARDI Domingo (URU)', 'CRISTOPHE Henry (BEL)', 'REGO Gilberto (BRA)', 201, 1096, 'FRA', 'MEX'),
 (1, 1930, '13 Jul 1930 - 15:00 ', 'Group 4', 'Parque Central', 'Montevideo ', 'USA', 3, 0, 'Belgium', ' ', 18346.0, 2, 0, 'MACIAS Jose (ARG)', 'MATEUCCI Francisco (URU)', 'WARNKEN Alberto (CHI)', 201, 1090, 'USA', 'BEL'),
 (2, 1930, '14 Jul 1930 - 12:45 ', 'Group 2', 'Parque Central', 'Montevideo ', 'Yugoslavia', 2, 1, 'Brazil', ' ', 24059.0, 2, 0, 'TEJADA Anibal (URU)', 'VALLARINO Ricardo (URU)', 'BALWAY Thomas (FRA)', 201, 1093, 'YUG', 'BRA'),
 (3, 1930, '14 Jul 1930 - 14:50 ', 'Group 3', 'Pocitos', 'Montevideo ', 'Romania', 3, 1, 'Peru', ' ', 2549.0, 1, 0, 'WARNKEN Alberto (CHI)', 'LANGENUS Jean (BEL)', 'MATEUCCI Francisco (URU)', 201, 1098, 'ROU', 'PER'),
 (4, 1930, '15 Jul 1930 - 16:00 ', 'Group 1', 'Parque Central', 'Montevideo ', 'Argentina', 1, 0, 'France', ' ', 23409.0, 0, 0, 'REGO Gilberto (BRA)', 'SAUCEDO Ulises (BOL)', 'RADULESCU Constantin (ROU)', 201, 1085, 'ARG', 'FRA')]

In [38]:
%sql select Region from Interpol limit 10;

 * sqlite://
Done.

[('Europe',),
 ('Northern Africa',),
 ('South America',),
 ('Oceania',),
 ('Europe',),
 ('Asia',),
 ('Europe',),
 ('Europe',),
 ('Central America',),
 ('South America',)]

In [41]:
%sql select Country from Interpol limit 30;

 * sqlite://
Done.

[('Albania',),
 ('Angola',),
 ('Argentina',),
 ('Australia',),
 ('Austria',),
 ('Bangladesh',),
 ('Belarus',),
 ('Belgium',),
 ('Belize',),
 ('Bolivia',),
 ('Botswana',),
 ('Brazil',),
 ('Cambodia',),
 ('Canada',),
 ('Cayman Islands',),
 ('Chile',),
 ('Colombia',),
 ('Congo',),
 ('Costa Rica',),
 ('Croatia',),
 ('Curaçao',),
 ('Czech Republic',),
 ('Denmark',),
 ('Dominican Republic',),
 ('Ecuador',),
 ('El Salvador',),
 ('Estonia',),
 ('Finland',),
 ('France',),
 ('Georgia, Asia',)]

In [42]:
%sql select Region from Interpol WHERE 'National Fugitives' = 0

 * sqlite://
Done.

[]

In [43]:
%sql select Country from Interpol WHERE 'National Fugitives' = 1 AND Region = 'Europe'

 * sqlite://
Done.

[]

In [44]:
#q1

In [58]:
%sql select Region from Interpol WHERE 'Possible Hosted Fugitives / Captured Fugitives'

 * sqlite://
Done.

[]

In [46]:
%sql select Country from Interpol WHERE 'National Fugitives' = 0 AND 'Wanted Fugitives' = 0

 * sqlite://
Done.

[]

In [53]:
%sql select Country from Interpol WHERE 'National Fugitives' = 3 AND Region = 'Europe'

 * sqlite://
Done.

[]